"SJVideoPlayer_ReplayButtonTitle" = "Replay";
"SJVideoPlayer_PlayFailedPromptText" = "Video failed to load, please try again later";
"SJVideoPlayer_PlayFailedButtonTitle" = "Retry";

"SJVideoPlayer_UnstableNetworkPromptText" = "Unstable network. Please check the network";
"SJVideoPlayer_CellularNetworkPromptText" = "Currently not using WiFi, please monitor data usage";
"SJVideoPlayer_NotNetworkPromptText" = "Network timeout, please try again under a stable network";
"SJVideoPlayer_NotNetworkButtonTitle" = "Reload";
"SJVideoPlayer_LiveText" = "Live Broadcast";

///**
// top btn
// 左上角按钮
// - 取消
// - 完成
// */
//@property (nonatomic, strong) NSString *cancelText;
//@property (nonatomic, strong) NSString *doneText;
"SJVideoPlayer_CancelButtonTitle" = "Cancel";
"SJVideoPlayer_DoneButtonTitle" = "Done";

///**
// 录制时右侧按钮
// - 等待中
// - 可完成
// */
//@property (nonatomic, strong) NSString *waitingText;
//@property (nonatomic, strong) NSString *finishText;
"SJVideoPlayer_WaitingPromptText" = "In preparation, please wait a moment";
"SJVideoPlayer_FinishedPromptText" = "Click on the right button to finish recording";

///**
// export
// 导出
// - 导出中
// - 导出失败
// - 导出成功
// - 录制成功
// - 截屏成功
// */
//@property (nonatomic, strong) NSString *exportingText;
//@property (nonatomic, strong) NSString *exportFailedText;
//@property (nonatomic, strong) NSString *exportSucceededText;
//@property (nonatomic, strong) NSString *screenshotSucceededText;
"SJVideoPlayer_ExportingPromptText" = "Exporting";
"SJVideoPlayer_ExportFailedPromptText" = "Export failed";
"SJVideoPlayer_ExportSucceededPromptText" = "Export success";
"SJVideoPlayer_ScreenshotSucceededPromptText" = "Screenshot success";

///**
// album
// 保存至相册
// - 已保存至相册
// - 保存失败, 相册访问权限未开启
// */
//@property (nonatomic, strong) NSString *albumAuthDeniedText;
//@property (nonatomic, strong) NSString *savingToAlbumText;
//@property (nonatomic, strong) NSString *savedToAlbumText;
"SJVideoPlayer_AlbumAuthDeniedPromptText" = "Save failed, please open album access in settings";
"SJVideoPlayer_SavingToAlbumPromptText" = "Saving...";
"SJVideoPlayer_SavedToAlbumPromptText" = "Saved to album";

///**
// upload
// 上传
// - 上传中
// - 上传成功
// - 上传失败
// */
//@property (nonatomic, strong) NSString *uploadingText;
//@property (nonatomic, strong) NSString *uploadFailedText;
//@property (nonatomic, strong) NSString *uploadSucceededText;
"SJVideoPlayer_UplodingPromptText" = "Uploading";
"SJVideoPlayer_UploadFailedPromptText" = "Upload failed";
"SJVideoPlayer_UploadSucceededPromptText" = "Upload success";

"SJVideoPlayer_OperationFailedPromptText" = "The operation failed";
